cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
Indicates BAT Updates

</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMP</name>
               <description>Temperature

Last Measured Temperature in Degrees Celsius

This register may be read while TEMPUPD.STAT = 1.

</description>
               <addressOffset>48</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT</name>
                     <description>INT</description>
                     <bitRange>[16:8]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPUPD</name>
               <description>Temperature Update

Indicates TEMP Updates

</description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>AON_EVENT</name>
         <description>This module configures the event fabric located in the AON domain.

Note: This module is only supporting 32 bit ReadWrite access from MCU

</description>
         <baseAddress>0x40093000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MCUWUSEL</name>
               <description>Wake-up Selector For MCU

This register contains pointers to 4 events which are routed to AON_WUC as wakeup sources for MCU. AON_WUC will start a wakeup sequence for the MCU domain when either of the 4 selected events are asserted. A wakeup sequence will guarantee that the MCU power switches are turned on, LDO resources are available and SCLK_HF is available and selected as clock source for MCU.

Note: It is recommended ( or required when AON_WUC:MCUCLK.PWR_DWN_SRC=NONE) to also setup a wakeup event here before MCU is requesting powerdown. ( PRCM requests uLDO, see conditions in PRCM:VDCTL.ULDO ) as it will speed up the wakeup procedure.

</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x3f3f3f3f</resetValue>
               <fields>
                  <field>
                     <name>WU3_EV</name>
                     <description>WU3_EV</description>
                     <bitRange>[29:24]</bitRange>
                  </field>
                  <field>
                     <name>WU2_EV</name>
                     <description>WU2_EV</description>
                     <bitRange>[21:16]</bitRange>
                  </field>
                  <field>
                     <name>WU1_EV</name>
                     <description>WU1_EV</description>
                     <bitRange>[13:8]</bitRange>
                  </field>
                  <field>
                     <name>WU0_EV</name>
                     <description>WU0_EV</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXWUSEL</name>
               <description>Wake-up Selector For AUX

This register contains pointers to 3 events which are routed to AON_WUC as wakeup sources for AUX. AON_WUC will start a wakeup sequence for the AUX domain when either of the 3 selected events are asserted. A wakeup sequence will guarantee that the AUX power switches are turned on, LDO resources are available and SCLK_HF is available and selected as clock source for AUX.

Note: It is recommended ( or required when AON_WUC:AUXCLK.PWR_DWN_SRC=NONE) to also setup a wakeup event here before AUX is requesting powerdown. ( AUX_WUC:PWRDWNREQ.REQ is asserted] ) as it will speed up the wakeup procedure.

</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x003f3f3f</resetValue>
               <fields>
                  <field>
                     <name>WU2_EV</name>
                     <description>WU2_EV</description>
                     <bitRange>[21:16]</bitRange>
                  </field>
                  <field>
                     <name>WU1_EV</name>
                     <description>WU1_EV</description>
                     <bitRange>[13:8]</bitRange>
                  </field>
                  <field>
                     <name>WU0_EV</name>
                     <description>WU0_EV</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVTOMCUSEL</name>
               <description>Event Selector For MCU Event Fabric 

This register contains pointers for 3 AON events that are routed to the MCU Event Fabric EVENT
</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x002b2b2b</resetValue>
               <fields>
                  <field>
                     <name>AON_PROG2_EV</name>
                     <description>AON_PROG2_EV</description>
                     <bitRange>[21:16]</bitRange>
                  </field>
                  <field>
                     <name>AON_PROG1_EV</name>
                     <description>AON_PROG1_EV</description>
                     <bitRange>[13:8]</bitRange>
                  </field>
                  <field>
                     <name>AON_PROG0_EV</name>
                     <description>AON_PROG0_EV</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCSEL</name>
               <description>RTC Capture Event Selector For AON_RTC

This register contains a pointer to select an AON event for RTC capture. Please refer to AON_RTC:CH1CAPT
</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000003f</resetValue>
               <fields>
                  <field>
                     <name>RTC_CH1_CAPT_EV</name>
                     <description>RTC_CH1_CAPT_EV</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
