cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>AON_IOC</name>
         <description>Always On (AON) IO Controller  - controls IO operation when the MCU IO Controller (IOC) is powered off and resides in the AON domain.  Note: This module only supports 32 bit Read/Write access from MCU.  </description>
         <baseAddress>0x40094000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IOSTRMIN</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>GRAY_CODE</name>
                     <description>GRAY_CODE</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOSTRMED</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000006</resetValue>
               <fields>
                  <field>
                     <name>GRAY_CODE</name>
                     <description>GRAY_CODE</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOSTRMAX</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>GRAY_CODE</name>
                     <description>GRAY_CODE</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCLATCH</name>
               <description>IO Latch Control

Controls transparency of all latches holding I/O or configuration state from the MCU IOC</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK32KCTL</name>
               <description>SCLK_LF External Output Control

</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>OE_N</name>
                     <description>OE_N</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>AON_RTC</name>
         <description>This component control the Real Time Clock residing in AON

Note: This module is only supporting 32 bit ReadWrite access. 
</description>
         <baseAddress>0x40092000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL</name>
               <description>Control

This register contains various  bitfields for configuration of RTC</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMB_EV_MASK</name>
                     <description>COMB_EV_MASK</description>
                     <bitRange>[18:16]</bitRange>
                  </field>
                  <field>
                     <name>EV_DELAY</name>
                     <description>EV_DELAY</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>RESET</name>
                     <description>RESET</description>
                     <bitRange>[7:7]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RTC_4KHZ_EN</name>
                     <description>RTC_4KHZ_EN</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>RTC_UPD_EN</name>
                     <description>RTC_UPD_EN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVFLAGS</name>
               <description>Event Flags, RTC Status

This register contains event flags from the 3 RTC channels. Each flag will be cleared when writing a '1' to the corresponding bitfield.

</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH2</name>
                     <description>CH2</description>
                     <bitRange>[16:16]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>CH1</name>
                     <description>CH1</description>
                     <bitRange>[8:8]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>CH0</name>
                     <description>CH0</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEC</name>
               <description>Second Counter Value, Integer Part</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSEC</name>
               <description>Second Counter Value, Fractional Part</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSECINC</name>
               <description>Subseconds Increment
Value added to SUBSEC.VALUE on every SCLK_LFclock cycle.</description>
               <addressOffset>16</addressOffset>
               <access>read-only</access>
               <resetValue>0x00800000</resetValue>
               <fields>
                  <field>
                     <name>VALUEINC</name>
                     <description>VALUEINC</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHCTL</name>
               <description>Channel Configuration
</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH2_CONT_EN</name>
                     <description>CH2_CONT_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>CH2_EN</name>
                     <description>CH2_EN</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>CH1_CAPT_EN</name>
                     <description>CH1_CAPT_EN</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>CH1_EN</name>
                     <description>CH1_EN</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>CH0_EN</name>
                     <description>CH0_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH0CMP</name>
               <description>Channel 0 Compare Value
</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH1CMP</name>
               <description>Channel 1 Compare Value
</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH2CMP</name>
               <description>Channel 2 Compare Value
</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH2CMPINC</name>
               <description>Channel 2 Compare Value Auto-increment

This register is primarily used to generate periodical wake-up for the AUX_SCE module, through the [AUX_EVCTL.EVSTAT0.AON_RTC] event.
</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH1CAPT</name>
               <description>Channel 1 Capture Value

