cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>AUX_AIODIO0</name>
         <description>AUX Analog/Digital Input Output Controller  </description>
         <baseAddress>0x400c1000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>GPIODOUT</name>
               <description>General Purpose Input/Output Data Out

This register is used to set data on the pads assigned to AUX</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7_0</name>
                     <description>IO7_0</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOMODE</name>
               <description>Input Output Mode

Controls pull-up pull-down and output mode for the IO pins assigned to AUX</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7</name>
                     <description>IO7</description>
                     <bitRange>[15:14]</bitRange>
                  </field>
                  <field>
                     <name>IO6</name>
                     <description>IO6</description>
                     <bitRange>[13:12]</bitRange>
                  </field>
                  <field>
                     <name>IO5</name>
                     <description>IO5</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IO4</name>
                     <description>IO4</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>IO3</name>
                     <description>IO3</description>
                     <bitRange>[7:6]</bitRange>
                  </field>
                  <field>
                     <name>IO2</name>
                     <description>IO2</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>IO1</name>
                     <description>IO1</description>
                     <bitRange>[3:2]</bitRange>
                  </field>
                  <field>
                     <name>IO0</name>
                     <description>IO0</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIODIN</name>
               <description>General Purpose Input Output Data In</description>
               <addressOffset>8</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7_0</name>
                     <description>IO7_0</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIODOUTSET</name>
               <description>General Purpose Input Output Data Out Set

Strobes for setting output data register bits</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7_0</name>
                     <description>IO7_0</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIODOUTCLR</name>
               <description>General Purpose Input Output Data Out Clear

Strobes for clearing output data register bits</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7_0</name>
                     <description>IO7_0</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIODOUTTGL</name>
               <description>General Purpose Input Output Data Out Toggle

Strobes for toggling output data register bits</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7_0</name>
                     <description>IO7_0</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIODIE</name>
               <description>General Purpose Input Output Input Enable</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7_0</name>
                     <description>IO7_0</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>AUX_AIODIO1</name>
         <description>AUX Analog/Digital Input Output Controller  </description>
         <baseAddress>0x400c2000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>GPIODOUT</name>
               <description>General Purpose Input/Output Data Out

This register is used to set data on the pads assigned to AUX</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO7_0</name>
                     <description>IO7_0</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOMODE</name>
               <description>Input Output Mode

