cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
FIFO can hold up to four ADC samples</description>
               <addressOffset>20</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>OVERFLOW</name>
                     <description>OVERFLOW</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>UNDERFLOW</name>
                     <description>UNDERFLOW</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>FULL</name>
                     <description>FULL</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>ALMOST_FULL</name>
                     <description>ALMOST_FULL</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>EMPTY</name>
                     <description>EMPTY</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCFIFO</name>
               <description>ADC FIFO</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[11:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCTRIG</name>
               <description>ADC Trigger</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START</name>
                     <description>START</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISRCCTL</name>
               <description>Current Source Control</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>RESET_N</name>
                     <description>RESET_N</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>AUX_DDI0_OSC</name>
         <description>This is the DDI for the digital block that controls all the analog clock oscillators  (OSC_DIG) and performs qualification of the clocks generated.</description>
         <baseAddress>0x400ca000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL0</name>
               <description>Control 0
Controls various clock source selects</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XTAL_IS_24M</name>
                     <description>XTAL_IS_24M</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>BYPASS_XOSC_LF_CLK_QUAL</name>
                     <description>BYPASS_XOSC_LF_CLK_QUAL</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>BYPASS_RCOSC_LF_CLK_QUAL</name>
                     <description>BYPASS_RCOSC_LF_CLK_QUAL</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>DOUBLER_START_DURATION</name>
                     <description>DOUBLER_START_DURATION</description>
                     <bitRange>[27:26]</bitRange>
                  </field>
                  <field>
                     <name>DOUBLER_RESET_DURATION</name>
                     <description>DOUBLER_RESET_DURATION</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>FORCE_KICKSTART_EN</name>
                     <description>FORCE_KICKSTART_EN</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>ALLOW_SCLK_HF_SWITCHING</name>
                     <description>ALLOW_SCLK_HF_SWITCHING</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>RCOSC_LF_TRIMMED</name>
                     <description>RCOSC_LF_TRIMMED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_POWER_MODE</name>
                     <description>XOSC_HF_POWER_MODE</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_LF_DIG_BYPASS</name>
                     <description>XOSC_LF_DIG_BYPASS</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>CLK_LOSS_EN</name>
                     <description>CLK_LOSS_EN</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_TDC_SRC_SEL</name>
                     <description>ACLK_TDC_SRC_SEL</description>
                     <bitRange>[8:7]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_REF_SRC_SEL</name>
                     <description>ACLK_REF_SRC_SEL</description>
                     <bitRange>[6:5]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_LF_SRC_SEL</name>
                     <description>SCLK_LF_SRC_SEL</description>
                     <bitRange>[3:2]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_MF_SRC_SEL</name>
                     <description>SCLK_MF_SRC_SEL</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_HF_SRC_SEL</name>
                     <description>SCLK_HF_SRC_SEL</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL1</name>
               <description>Control 1
This register contains various OSC_DIG configuration</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RCOSCHFCTRIMFRACT</name>
                     <description>RCOSCHFCTRIMFRACT</description>
                     <bitRange>[22:18]</bitRange>
                  </field>
                  <field>
                     <name>RCOSCHFCTRIMFRACT_EN</name>
                     <description>RCOSCHFCTRIMFRACT_EN</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_FAST_START</name>
                     <description>XOSC_HF_FAST_START</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RADCEXTCFG</name>
               <description>RADC External Configuration 

</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HPM_IBIAS_WAIT_CNT</name>
                     <description>HPM_IBIAS_WAIT_CNT</description>
                     <bitRange>[31:22]</bitRange>
                  </field>
                  <field>
                     <name>LPM_IBIAS_WAIT_CNT</name>
                     <description>LPM_IBIAS_WAIT_CNT</description>
                     <bitRange>[21:16]</bitRange>
                  </field>
                  <field>
                     <name>IDAC_STEP</name>
                     <description>IDAC_STEP</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>RADC_DAC_TH</name>
                     <description>RADC_DAC_TH</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>RADC_MODE_IS_SAR</name>
                     <description>RADC_MODE_IS_SAR</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMPCOMPCTL</name>
               <description>Amplitude Compensation Control

</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AMPCOMP_REQ_MODE</name>
                     <description>AMPCOMP_REQ_MODE</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>AMPCOMP_FSM_UPDATE_RATE</name>
                     <description>AMPCOMP_FSM_UPDATE_RATE</description>
                     <bitRange>[29:28]</bitRange>
                  </field>
                  <field>
                     <name>AMPCOMP_SW_CTRL</name>
                     <description>AMPCOMP_SW_CTRL</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>AMPCOMP_SW_EN</name>
                     <description>AMPCOMP_SW_EN</description>
                     <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                     <name>IBIAS_OFFSET</name>
                     <description>IBIAS_OFFSET</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>IBIAS_INIT</name>
                     <description>IBIAS_INIT</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
                     <description>LPM_IBIAS_WAIT_CNT_FINAL</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>CAP_STEP</name>
                     <description>CAP_STEP</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>IBIASCAP_HPTOLP_OL_CNT</name>
                     <description>IBIASCAP_HPTOLP_OL_CNT</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMPCOMPTH1</name>
               <description>Amplitude Compensation Threashold 1
This register contains various threshhold values for amplitude compensation algorithm

</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HPMRAMP3_LTH</name>
                     <description>HPMRAMP3_LTH</description>
                     <bitRange>[23:18]</bitRange>
                  </field>
                  <field>
                     <name>HPMRAMP3_HTH</name>
                     <description>HPMRAMP3_HTH</description>
                     <bitRange>[15:10]</bitRange>
                  </field>
                  <field>
                     <name>IBIASCAP_LPTOHP_OL_CNT</name>
                     <description>IBIASCAP_LPTOHP_OL_CNT</description>
                     <bitRange>[9:6]</bitRange>
                  </field>
                  <field>
                     <name>HPMRAMP1_TH</name>
                     <description>HPMRAMP1_TH</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMPCOMPTH2</name>
               <description>Amplitude Compensation Threashold 2
This register contains various threshhold values for amplitude compensation algorithm.

</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPMUPDATE_LTH</name>
                     <description>LPMUPDATE_LTH</description>
                     <bitRange>[31:26]</bitRange>
                  </field>
                  <field>
                     <name>LPMUPDATE_HTH</name>
                     <description>LPMUPDATE_HTH</description>
                     <bitRange>[23:18]</bitRange>
                  </field>
                  <field>
                     <name>ADC_COMP_AMPTH_LPM</name>
                     <description>ADC_COMP_AMPTH_LPM</description>
                     <bitRange>[15:10]</bitRange>
                  </field>
                  <field>
                     <name>ADC_COMP_AMPTH_HPM</name>
                     <description>ADC_COMP_AMPTH_HPM</description>
                     <bitRange>[7:2]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ANABYPASSVAL1</name>
               <description>Analog Bypass Values 1
</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC_HF_ROW_Q12</name>
                     <description>XOSC_HF_ROW_Q12</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_COLUMN_Q12</name>
                     <description>XOSC_HF_COLUMN_Q12</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ANABYPASSVAL2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC_HF_IBIASTHERM</name>
                     <description>XOSC_HF_IBIASTHERM</description>
                     <bitRange>[13:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATESTCTL</name>
               <description>Analog Test Control

</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCLK_LF_AUX_EN</name>
                     <description>SCLK_LF_AUX_EN</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCDOUBLERNANOAMPCTL</name>
               <description>ADC Doubler Nanoamp Control

</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NANOAMP_BIAS_ENABLE</name>
                     <description>NANOAMP_BIAS_ENABLE</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>SPARE23</name>
                     <description>SPARE23</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>ADC_SH_MODE_EN</name>
                     <description>ADC_SH_MODE_EN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>ADC_SH_VBUF_EN</name>
                     <description>ADC_SH_VBUF_EN</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>ADC_IREF_CTRL</name>
                     <description>ADC_IREF_CTRL</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSCHFCTL</name>
               <description>XOSCHF Control

</description>
               <addressOffset>40</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PEAK_DET_ITRIM</name>
                     <description>PEAK_DET_ITRIM</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>BYPASS</name>
                     <description>BYPASS</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>HP_BUF_ITRIM</name>
                     <description>HP_BUF_ITRIM</description>
                     <bitRange>[4:2]</bitRange>
                  </field>
                  <field>
                     <name>LP_BUF_ITRIM</name>
                     <description>LP_BUF_ITRIM</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>LFOSCCTL</name>
               <description>Low Frequency Oscillator Control

</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCLF_REGULATOR_TRIM</name>
                     <description>XOSCLF_REGULATOR_TRIM</description>
                     <bitRange>[23:22]</bitRange>
                  </field>
                  <field>
                     <name>XOSCLF_CMIRRWR_RATIO</name>
                     <description>XOSCLF_CMIRRWR_RATIO</description>
                     <bitRange>[21:18]</bitRange>
                  </field>
                  <field>
                     <name>RCOSCLF_RTUNE_TRIM</name>
                     <description>RCOSCLF_RTUNE_TRIM</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>RCOSCLF_CTUNE_TRIM</name>
                     <description>RCOSCLF_CTUNE_TRIM</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCOSCHFCTL</name>
               <description>RCOSCHF Control

</description>
               <addressOffset>48</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RCOSCHF_CTRIM</name>
                     <description>RCOSCHF_CTRIM</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT0</name>
               <description>Status 0
This register contains status signals from OSC_DIG

