cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
</description>
               <addressOffset>52</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCLK_LF_SRC</name>
                     <description>SCLK_LF_SRC</description>
                     <bitRange>[30:29]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_HF_SRC</name>
                     <description>SCLK_HF_SRC</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>RCOSC_HF_EN</name>
                     <description>RCOSC_HF_EN</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>RCOSC_LF_EN</name>
                     <description>RCOSC_LF_EN</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_LF_EN</name>
                     <description>XOSC_LF_EN</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>CLK_DCDC_RDY</name>
                     <description>CLK_DCDC_RDY</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>CLK_DCDC_RDY_ACK</name>
                     <description>CLK_DCDC_RDY_ACK</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_HF_LOSS</name>
                     <description>SCLK_HF_LOSS</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_LF_LOSS</name>
                     <description>SCLK_LF_LOSS</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_EN</name>
                     <description>XOSC_HF_EN</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>XB_48M_CLK_EN</name>
                     <description>XB_48M_CLK_EN</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_LP_BUF_EN</name>
                     <description>XOSC_HF_LP_BUF_EN</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_HP_BUF_EN</name>
                     <description>XOSC_HF_HP_BUF_EN</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>ADC_THMET</name>
                     <description>ADC_THMET</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DATA_READY</name>
                     <description>ADC_DATA_READY</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DATA</name>
                     <description>ADC_DATA</description>
                     <bitRange>[6:1]</bitRange>
                  </field>
                  <field>
                     <name>PENDINGSCLKHFSWITCHING</name>
                     <description>PENDINGSCLKHFSWITCHING</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT1</name>
               <description>Status 1
This register contains status signals from OSC_DIG

</description>
               <addressOffset>56</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RAMPSTATE</name>
                     <description>RAMPSTATE</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>HMP_UPDATE_AMP</name>
                     <description>HMP_UPDATE_AMP</description>
                     <bitRange>[27:22]</bitRange>
                  </field>
                  <field>
                     <name>LPM_UPDATE_AMP</name>
                     <description>LPM_UPDATE_AMP</description>
                     <bitRange>[21:16]</bitRange>
                  </field>
                  <field>
                     <name>FORCE_RCOSC_HF</name>
                     <description>FORCE_RCOSC_HF</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_HF_EN</name>
                     <description>SCLK_HF_EN</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_MF_EN</name>
                     <description>SCLK_MF_EN</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_ADC_EN</name>
                     <description>ACLK_ADC_EN</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_TDC_EN</name>
                     <description>ACLK_TDC_EN</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_REF_EN</name>
                     <description>ACLK_REF_EN</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>CLK_CHP_EN</name>
                     <description>CLK_CHP_EN</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>CLK_DCDC_EN</name>
                     <description>CLK_DCDC_EN</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_HF_GOOD</name>
                     <description>SCLK_HF_GOOD</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_MF_GOOD</name>
                     <description>SCLK_MF_GOOD</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_LF_GOOD</name>
                     <description>SCLK_LF_GOOD</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_ADC_GOOD</name>
                     <description>ACLK_ADC_GOOD</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_TDC_GOOD</name>
                     <description>ACLK_TDC_GOOD</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_REF_GOOD</name>
                     <description>ACLK_REF_GOOD</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CLK_CHP_GOOD</name>
                     <description>CLK_CHP_GOOD</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>CLK_DCDC_GOOD</name>
                     <description>CLK_DCDC_GOOD</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT2</name>
               <description>Status 2
This register contains status signals from AMPCOMP FSM

</description>
               <addressOffset>60</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC_DCBIAS</name>
                     <description>ADC_DCBIAS</description>
                     <bitRange>[31:26]</bitRange>
                  </field>
                  <field>
                     <name>HPM_RAMP1_THMET</name>
                     <description>HPM_RAMP1_THMET</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>HPM_RAMP2_THMET</name>
                     <description>HPM_RAMP2_THMET</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>HPM_RAMP3_THMET</name>
                     <description>HPM_RAMP3_THMET</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>RAMPSTATE</name>
                     <description>RAMPSTATE</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>AMPCOMP_REQ</name>
                     <description>AMPCOMP_REQ</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_AMPGOOD</name>
                     <description>XOSC_HF_AMPGOOD</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_FREQGOOD</name>
                     <description>XOSC_HF_FREQGOOD</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_RF_FREQGOOD</name>
                     <description>XOSC_HF_RF_FREQGOOD</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
