cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>AUX_EVCTL</name>
         <description>AUX Event Controller  </description>
         <baseAddress>0x400c5000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>VECCFG0</name>
               <description>Vector Configuration 0

AUX_SCE event vectors 0 and 1 configuration</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VEC1_POL</name>
                     <description>VEC1_POL</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>VEC1_EN</name>
                     <description>VEC1_EN</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>VEC1_EV</name>
                     <description>VEC1_EV</description>
                     <bitRange>[12:8]</bitRange>
                  </field>
                  <field>
                     <name>VEC0_POL</name>
                     <description>VEC0_POL</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>VEC0_EN</name>
                     <description>VEC0_EN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>VEC0_EV</name>
                     <description>VEC0_EV</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VECCFG1</name>
               <description>Vector Configuration 1

AUX_SCE event vectors 2 and 3 configuration</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VEC3_POL</name>
                     <description>VEC3_POL</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>VEC3_EN</name>
                     <description>VEC3_EN</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>VEC3_EV</name>
                     <description>VEC3_EV</description>
                     <bitRange>[12:8]</bitRange>
                  </field>
                  <field>
                     <name>VEC2_POL</name>
                     <description>VEC2_POL</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>VEC2_EN</name>
                     <description>VEC2_EN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>VEC2_EV</name>
                     <description>VEC2_EV</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCEWEVSEL</name>
               <description>Sensor Controller Engine Wait Event Selection

Event selection for the AUX_SCE WEV0, WEV1, BEV0 and BEV1 instructions</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WEV7_EV</name>
                     <description>WEV7_EV</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVTOAONFLAGS</name>
               <description>Events To AON Domain Flags

AUX event flags going to/through the AON domain

These events may be used to wake up the MCU domain.

The flags may be cleared by writing 0 to these bits or writing 1 to the corresponding bits in EVTOAONFLAGSCLR.</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[8:8]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[7:7]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[6:6]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[5:5]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[4:4]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[3:3]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>SWEV2</name>
                     <description>SWEV2</description>
                     <bitRange>[2:2]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>SWEV1</name>
                     <description>SWEV1</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>SWEV0</name>
                     <description>SWEV0</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVTOAONPOL</name>
               <description>Events To AON Domain Polarity

AUX event source polarity for the event flags going to/through the AON domain

Note the inverse polarity (0 = high, 1 = low).</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACTL</name>
               <description>Direct Memory Access Control</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REQ_MODE</name>
                     <description>REQ_MODE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SEL</name>
                     <description>SEL</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWEVSET</name>
               <description>Software Event Set

