cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
Strobes for setting software events from the AUX domain to the AON/MCU Domains

The use of these events is software-defined.</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWEV2</name>
                     <description>SWEV2</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>SWEV1</name>
                     <description>SWEV1</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SWEV0</name>
                     <description>SWEV0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVSTAT0</name>
               <description>Event Status 0

Current event source levels, 15:0</description>
               <addressOffset>28</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AUXIO2</name>
                     <description>AUXIO2</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO1</name>
                     <description>AUXIO1</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO0</name>
                     <description>AUXIO0</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>AON_PROG_WU</name>
                     <description>AON_PROG_WU</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>AON_SW</name>
                     <description>AON_SW</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>OBSMUX1</name>
                     <description>OBSMUX1</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>OBSMUX0</name>
                     <description>OBSMUX0</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>ADC_FIFO_ALMOST_FULL</name>
                     <description>ADC_FIFO_ALMOST_FULL</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SMPH_AUTOTAKE_DONE</name>
                     <description>SMPH_AUTOTAKE_DONE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AON_RTC_CH2</name>
                     <description>AON_RTC_CH2</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVSTAT1</name>
               <description>Event Status 1

Current event source levels, 31:16</description>
               <addressOffset>32</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC_IRQ</name>
                     <description>ADC_IRQ</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>MCU_EV</name>
                     <description>MCU_EV</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>ACLK_REF</name>
                     <description>ACLK_REF</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO15</name>
                     <description>AUXIO15</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO14</name>
                     <description>AUXIO14</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO13</name>
                     <description>AUXIO13</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO12</name>
                     <description>AUXIO12</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO11</name>
                     <description>AUXIO11</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO10</name>
                     <description>AUXIO10</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO9</name>
                     <description>AUXIO9</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO8</name>
                     <description>AUXIO8</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO7</name>
                     <description>AUXIO7</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO6</name>
                     <description>AUXIO6</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO5</name>
                     <description>AUXIO5</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO4</name>
                     <description>AUXIO4</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AUXIO3</name>
                     <description>AUXIO3</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVTOMCUPOL</name>
               <description>Event To MCU Domain Polarity

