cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
If a vector flag has been set and AUX_SCE is sleeping, it will wake up and execute the vector. If multiple vectors have been set, the one with the lowest index will execute first, and the next after returning to sleep.

During execution of a vector, the flag must be cleared, by writing a 1 to the corresponding bit in VECFLAGSCLR. </description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VEC3</name>
                     <description>VEC3</description>
                     <bitRange>[3:3]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>VEC2</name>
                     <description>VEC2</description>
                     <bitRange>[2:2]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>VEC1</name>
                     <description>VEC1</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>VEC0</name>
                     <description>VEC0</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVTOMCUFLAGSCLR</name>
               <description>Events To MCU Domain Flags Clear

Strobes for clearing flags in EVTOMCUFLAGS.</description>
               <addressOffset>56</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC_IRQ</name>
                     <description>ADC_IRQ</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>OBSMUX0</name>
                     <description>OBSMUX0</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>ADC_FIFO_ALMOST_FULL</name>
                     <description>ADC_FIFO_ALMOST_FULL</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SMPH_AUTOTAKE_DONE</name>
                     <description>SMPH_AUTOTAKE_DONE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AON_WU_EV</name>
                     <description>AON_WU_EV</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVTOAONFLAGSCLR</name>
               <description>Events To AON Domain Clear

Strobes for clearing flags in EVTOAONFLAGS.</description>
               <addressOffset>60</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>SWEV2</name>
                     <description>SWEV2</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>SWEV1</name>
                     <description>SWEV1</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SWEV0</name>
                     <description>SWEV0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VECFLAGSCLR</name>
               <description>Vector Flags Clear

