cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>AUX_SMPH</name>
         <description>AUX Semaphore Controller

</description>
         <baseAddress>0x400c8000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SMPH0</name>
               <description>Semaphore 0</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPH1</name>
               <description>Semaphore 1</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPH2</name>
               <description>Semaphore 2</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPH3</name>
               <description>Semaphore 3</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPH4</name>
               <description>Semaphore 4</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPH5</name>
               <description>Semaphore 5</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPH6</name>
               <description>Semaphore 6</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPH7</name>
               <description>Semaphore 7</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUTOTAKE</name>
               <description>Sticky Request For Single Semaphore</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMPH_ID</name>
                     <description>SMPH_ID</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>AUX_TDCIF</name>
         <description>AUX Time To Digital Converter

</description>
         <baseAddress>0x400c4000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL</name>
               <description>Control</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>CMD</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <description>Status</description>
               <addressOffset>4</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000006</resetValue>
               <fields>
                  <field>
                     <name>SAT</name>
                     <description>SAT</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>DONE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>STATE</name>
                     <description>STATE</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <description>Result

Result of last TDC conversion</description>
               <addressOffset>8</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[24:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SATCFG</name>
               <description>Saturation Configuration</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000000f</resetValue>
               <fields>
                  <field>
                     <name>LIMIT</name>
                     <description>LIMIT</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRIGSRC</name>
               <description>Trigger Source

TDC start/stop trigger source selection</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STOP_POL</name>
                     <description>STOP_POL</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>STOP_SRC</name>
                     <description>STOP_SRC</description>
                     <bitRange>[12:8]</bitRange>
                  </field>
                  <field>
                     <name>START_POL</name>
                     <description>START_POL</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>START_SRC</name>
                     <description>START_SRC</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRIGCNT</name>
               <description>Trigger Counter

Stop counter status/control of TDC</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>CNT</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRIGCNTLOAD</name>
               <description>Trigger Counter Load

Stop counter control of TDC</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>CNT</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRIGCNTCFG</name>
               <description>Trigger Counter Configuration</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRECTL</name>
               <description>Prescaler Control

The prescaler can be used to count events that are faster than the AUX clock speed. It can be used standalone or as a start/stop source for the TDC by configuring TRIGSRC.START_SRC and TRIGSRC.STOP_SRC to TDC_PRE. When counting fast signals with the TDC that are faster than 1/10th of the clock frequency of AUX it is recommended to use the prescaler.

</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000001f</resetValue>
               <fields>
                  <field>
                     <name>RESET_N</name>
                     <description>RESET_N</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RATIO</name>
                     <description>RATIO</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>SRC</name>
                     <description>SRC</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRECNT</name>
               <description>Prescaler Counter

Value of prescaler counter</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>CNT</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
