cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
Controls latching of signals between AUX_AIODIO0/AUX_AIODIO1 and AON_IOC.</description>
               <addressOffset>84</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MODCLKEN1</name>
               <description>Module Clock Enable 1

Clock enable for each module in the AUX domain, for use by the AUX_SCE. Settings take effect immediately.

The settings in this register are OR'ed with the corresponding settings in MODCLKEN0. This allows system CPU and AUX_SCE to request clocks independently.</description>
               <addressOffset>92</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AUX_ADI4</name>
                     <description>AUX_ADI4</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>AUX_DDI0_OSC</name>
                     <description>AUX_DDI0_OSC</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>ANAIF</name>
                     <description>ANAIF</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TIMER</name>
                     <description>TIMER</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>AIODIO1</name>
                     <description>AIODIO1</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AIODIO0</name>
                     <description>AIODIO0</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SMPH</name>
                     <description>SMPH</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>CCFG</name>
         <description>Customer configuration area (CCFG)</description>
         <baseAddress>0x50003000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>EXT_LF_CLK</name>
               <description>Extern LF clock configuration</description>
               <addressOffset>4008</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>DIO</name>
                     <description>DIO</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>RTC_INCREMENT</name>
                     <description>RTC_INCREMENT</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MODE_CONF_1</name>
               <description>Mode Configuration 1</description>
               <addressOffset>4012</addressOffset>
               <access>read-only</access>
               <resetValue>0xfffbffff</resetValue>
               <fields>
                  <field>
                     <name>ALT_DCDC_VMIN</name>
                     <description>ALT_DCDC_VMIN</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>ALT_DCDC_DITHER_EN</name>
                     <description>ALT_DCDC_DITHER_EN</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>ALT_DCDC_IPEAK</name>
                     <description>ALT_DCDC_IPEAK</description>
                     <bitRange>[18:16]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_IBIAS_INIT</name>
                     <description>DELTA_IBIAS_INIT</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_IBIAS_OFFSET</name>
                     <description>DELTA_IBIAS_OFFSET</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_MAX_START</name>
                     <description>XOSC_MAX_START</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIZE_AND_DIS_FLAGS</name>
               <description>CCFG Size and Disable Flags</description>
               <addressOffset>4016</addressOffset>
               <access>read-only</access>
               <resetValue>0x10000ffff</resetValue>
               <fields>
                  <field>
                     <name>SIZE_OF_CCFG</name>
                     <description>SIZE_OF_CCFG</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>DISABLE_FLAGS</name>
                     <description>DISABLE_FLAGS</description>
                     <bitRange>[15:3]</bitRange>
                  </field>
                  <field>
                     <name>DIS_GPRAM</name>
                     <description>DIS_GPRAM</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>DIS_ALT_DCDC_SETTING</name>
                     <description>DIS_ALT_DCDC_SETTING</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DIS_XOSC_OVR</name>
                     <description>DIS_XOSC_OVR</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MODE_CONF</name>
               <description>Mode Configuration 0</description>
               <addressOffset>4020</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>VDDR_TRIM_SLEEP_DELTA</name>
                     <description>VDDR_TRIM_SLEEP_DELTA</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>DCDC_RECHARGE</name>
                     <description>DCDC_RECHARGE</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>DCDC_ACTIVE</name>
                     <description>DCDC_ACTIVE</description>
                     <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_EXT_LOAD</name>
                     <description>VDDR_EXT_LOAD</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>VDDS_BOD_LEVEL</name>
                     <description>VDDS_BOD_LEVEL</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_LF_OPTION</name>
                     <description>SCLK_LF_OPTION</description>
                     <bitRange>[23:22]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_TRIM_SLEEP_TC</name>
                     <description>VDDR_TRIM_SLEEP_TC</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>RTC_COMP</name>
                     <description>RTC_COMP</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_FREQ</name>
                     <description>XOSC_FREQ</description>
                     <bitRange>[19:18]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_CAP_MOD</name>
                     <description>XOSC_CAP_MOD</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>HF_COMP</name>
                     <description>HF_COMP</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_CAPARRAY_DELTA</name>
                     <description>XOSC_CAPARRAY_DELTA</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_CAP</name>
                     <description>VDDR_CAP</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VOLT_LOAD_0</name>
               <description>Voltage Load 0
Enabled by MODE_CONF.VDDR_EXT_LOAD.</description>
               <addressOffset>4024</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>VDDR_EXT_TP45</name>
                     <description>VDDR_EXT_TP45</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_EXT_TP25</name>
                     <description>VDDR_EXT_TP25</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_EXT_TP5</name>
                     <description>VDDR_EXT_TP5</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_EXT_TM15</name>
                     <description>VDDR_EXT_TM15</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VOLT_LOAD_1</name>
               <description>Voltage Load 1
Enabled by MODE_CONF.VDDR_EXT_LOAD.</description>
               <addressOffset>4028</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>VDDR_EXT_TP125</name>
                     <description>VDDR_EXT_TP125</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_EXT_TP105</name>
                     <description>VDDR_EXT_TP105</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_EXT_TP85</name>
                     <description>VDDR_EXT_TP85</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_EXT_TP65</name>
                     <description>VDDR_EXT_TP65</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_OFFSET</name>
               <description>Real Time Clock Offset
Enabled by MODE_CONF.RTC_COMP.</description>
               <addressOffset>4032</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RTC_COMP_P0</name>
                     <description>RTC_COMP_P0</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>RTC_COMP_P1</name>
                     <description>RTC_COMP_P1</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>RTC_COMP_P2</name>
                     <description>RTC_COMP_P2</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FREQ_OFFSET</name>
               <description>Frequency Offset</description>
               <addressOffset>4036</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>HF_COMP_P0</name>
                     <description>HF_COMP_P0</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>HF_COMP_P1</name>
                     <description>HF_COMP_P1</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>HF_COMP_P2</name>
                     <description>HF_COMP_P2</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_MAC_0</name>
               <description>IEEE MAC Address 0</description>
               <addressOffset>4040</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ADDR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_MAC_1</name>
               <description>IEEE MAC Address 1</description>
               <addressOffset>4044</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ADDR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_BLE_0</name>
               <description>IEEE BLE Address 0</description>
               <addressOffset>4048</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ADDR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_BLE_1</name>
               <description>IEEE BLE Address 1</description>
               <addressOffset>4052</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ADDR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BL_CONFIG</name>
               <description>Bootloader Configuration
Configures the functionality of the ROM boot loader.
If both the boot loader is enabled by the BOOTLOADER_ENABLE field and the boot loader backdoor is enabled by the BL_ENABLE field it is possible to force entry of the ROM boot loader even if a valid image is present in flash.</description>
               <addressOffset>4056</addressOffset>
               <access>read-only</access>
               <resetValue>0xc5ffffff</resetValue>
               <fields>
                  <field>
                     <name>BOOTLOADER_ENABLE</name>
                     <description>BOOTLOADER_ENABLE</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>BL_LEVEL</name>
                     <description>BL_LEVEL</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>BL_PIN_NUMBER</name>
                     <description>BL_PIN_NUMBER</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BL_ENABLE</name>
                     <description>BL_ENABLE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERASE_CONF</name>
               <description>Erase Configuration</description>
               <addressOffset>4060</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>CHIP_ERASE_DIS_N</name>
                     <description>CHIP_ERASE_DIS_N</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>BANK_ERASE_DIS_N</name>
                     <description>BANK_ERASE_DIS_N</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_TI_OPTIONS</name>
               <description>TI Options</description>
               <addressOffset>4064</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffc5</resetValue>
               <fields>
                  <field>
                     <name>TI_FA_ENABLE</name>
                     <description>TI_FA_ENABLE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_TAP_DAP_0</name>
               <description>Test Access Points Enable 0</description>
               <addressOffset>4068</addressOffset>
               <access>read-only</access>
               <resetValue>0xffc5c5c5</resetValue>
               <fields>
                  <field>
                     <name>CPU_DAP_ENABLE</name>
                     <description>CPU_DAP_ENABLE</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>PRCM_TAP_ENABLE</name>
                     <description>PRCM_TAP_ENABLE</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>TEST_TAP_ENABLE</name>
                     <description>TEST_TAP_ENABLE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_TAP_DAP_1</name>
               <description>Test Access Points Enable 1</description>
               <addressOffset>4072</addressOffset>
               <access>read-only</access>
               <resetValue>0xffc5c5c5</resetValue>
               <fields>
                  <field>
                     <name>PBIST2_TAP_ENABLE</name>
                     <description>PBIST2_TAP_ENABLE</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>PBIST1_TAP_ENABLE</name>
                     <description>PBIST1_TAP_ENABLE</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>WUC_TAP_ENABLE</name>
                     <description>WUC_TAP_ENABLE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMAGE_VALID_CONF</name>
               <description>Image Valid </description>
               <addressOffset>4076</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>IMAGE_VALID</name>
                     <description>IMAGE_VALID</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
