cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>CPU_TIPROP</name>
         <description>Cortex-M's TI proprietary registers
</description>
         <baseAddress>0xe00fe000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>TRACECLKMUX</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4088</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRACECLK_N_SWV</name>
                     <description>TRACECLK_N_SWV</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DYN_CG</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4092</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DYN_CG</name>
                     <description>DYN_CG</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>CRYPTO</name>
         <description>Crypto core with DMA capability and local key storage

</description>
         <baseAddress>0x40024000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x800</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DMACH0CTL</name>
               <description>DMA Channel 0 Control</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRIO</name>
                     <description>PRIO</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACH0EXTADDR</name>
               <description>DMA Channel 0 External Address</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ADDR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACH0LEN</name>
               <description>DMA Channel 0 Length</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>LEN</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMASTAT</name>
               <description>DMA Controller Status</description>
               <addressOffset>24</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PORT_ERR</name>
                     <description>PORT_ERR</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>CH1_ACTIVE</name>
                     <description>CH1_ACTIVE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>CH0_ACTIVE</name>
                     <description>CH0_ACTIVE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMASWRESET</name>
               <description>DMA Controller Software Reset</description>
               <addressOffset>28</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESET</name>
                     <description>RESET</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACH1CTL</name>
               <description>DMA Channel 1 Control</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRIO</name>
                     <description>PRIO</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACH1EXTADDR</name>
               <description>DMA Channel 1 External Address</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ADDR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACH1LEN</name>
               <description>DMA Channel 1 Length</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>LEN</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMABUSCFG</name>
               <description>DMA Controller Master Configuration</description>
               <addressOffset>120</addressOffset>
               <access>read-write</access>
               <resetValue>0x00002400</resetValue>
               <fields>
                  <field>
                     <name>AHB_MST1_BURST_SIZE</name>
                     <description>AHB_MST1_BURST_SIZE</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>AHB_MST1_IDLE_EN</name>
                     <description>AHB_MST1_IDLE_EN</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>AHB_MST1_INCR_EN</name>
                     <description>AHB_MST1_INCR_EN</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>AHB_MST1_LOCK_EN</name>
                     <description>AHB_MST1_LOCK_EN</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>AHB_MST1_BIGEND</name>
                     <description>AHB_MST1_BIGEND</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAPORTERR</name>
               <description>DMA Controller Port Error</description>
               <addressOffset>124</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AHB_ERR</name>
                     <description>AHB_ERR</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>LAST_CH</name>
                     <description>LAST_CH</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAHWVER</name>
               <description>DMA Controller Version</description>
               <addressOffset>252</addressOffset>
               <access>read-only</access>
               <resetValue>0x01012ed1</resetValue>
               <fields>
                  <field>
                     <name>HW_MAJOR_VER</name>
                     <description>HW_MAJOR_VER</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>HW_MINOR_VER</name>
                     <description>HW_MINOR_VER</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>HW_PATCH_LVL</name>
                     <description>HW_PATCH_LVL</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>VER_NUM_COMPL</name>
                     <description>VER_NUM_COMPL</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>VER_NUM</name>
                     <description>VER_NUM</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYWRITEAREA</name>
               <description>Key Write Area</description>
               <addressOffset>1024</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RAM_AREA7</name>
                     <description>RAM_AREA7</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA6</name>
                     <description>RAM_AREA6</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA5</name>
                     <description>RAM_AREA5</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA4</name>
                     <description>RAM_AREA4</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA3</name>
                     <description>RAM_AREA3</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA2</name>
                     <description>RAM_AREA2</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA1</name>
                     <description>RAM_AREA1</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA0</name>
                     <description>RAM_AREA0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYWRITTENAREA</name>
               <description>Key Written Area Status
This register shows which areas of the key store RAM contain valid written keys.
When a new key needs to be written to the key store, on a location that is already occupied by a valid key, this key area must be cleared first. This can be done by writing this register before the new key is written to the key store memory.
Attempting to write to a key area that already contains a valid key is not allowed and will result in an error.</description>
               <addressOffset>1028</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RAM_AREA_WRITTEN7</name>
                     <description>RAM_AREA_WRITTEN7</description>
                     <bitRange>[7:7]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RAM_AREA_WRITTEN6</name>
                     <description>RAM_AREA_WRITTEN6</description>
                     <bitRange>[6:6]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RAM_AREA_WRITTEN5</name>
                     <description>RAM_AREA_WRITTEN5</description>
                     <bitRange>[5:5]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RAM_AREA_WRITTEN4</name>
                     <description>RAM_AREA_WRITTEN4</description>
                     <bitRange>[4:4]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RAM_AREA_WRITTEN3</name>
                     <description>RAM_AREA_WRITTEN3</description>
                     <bitRange>[3:3]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RAM_AREA_WRITTEN2</name>
                     <description>RAM_AREA_WRITTEN2</description>
                     <bitRange>[2:2]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RAM_AREA_WRITTEN1</name>
                     <description>RAM_AREA_WRITTEN1</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RAM_AREA_WRITTEN0</name>
                     <description>RAM_AREA_WRITTEN0</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYSIZE</name>
               <description>Key Size
This register defines the size of the keys that are written with DMA.</description>
               <addressOffset>1032</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>SIZE</name>
                     <description>SIZE</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYREADAREA</name>
               <description>Key Read Area</description>
               <addressOffset>1036</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000008</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>RAM_AREA</name>
                     <description>RAM_AREA</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0-3</dimIndex>
               <name>AESKEY2%s</name>
               <description>Clear AES_KEY2/GHASH Key</description>
               <addressOffset>1280</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>KEY2</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0-3</dimIndex>
               <name>AESKEY3%s</name>
               <description>Clear AES_KEY3</description>
               <addressOffset>1296</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY3</name>
                     <description>KEY3</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0-3</dimIndex>
               <name>AESIV%s</name>
               <description>AES Initialization Vector</description>
               <addressOffset>1344</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IV</name>
                     <description>IV</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESCTL</name>
               <description>AES Input/Output Buffer Control</description>
               <addressOffset>1360</addressOffset>
               <access>read-write</access>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>CONTEXT_RDY</name>
                     <description>CONTEXT_RDY</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>SAVED_CONTEXT_RDY</name>
                     <description>SAVED_CONTEXT_RDY</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>SAVE_CONTEXT</name>
                     <description>SAVE_CONTEXT</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>CCM_M</name>
                     <description>CCM_M</description>
                     <bitRange>[24:22]</bitRange>
                  </field>
                  <field>
                     <name>CCM_L</name>
                     <description>CCM_L</description>
                     <bitRange>[21:19]</bitRange>
                  </field>
                  <field>
                     <name>CCM</name>
                     <description>CCM</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>CBC_MAC</name>
                     <description>CBC_MAC</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>CTR_WIDTH</name>
                     <description>CTR_WIDTH</description>
                     <bitRange>[8:7]</bitRange>
                  </field>
                  <field>
                     <name>CTR</name>
                     <description>CTR</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>CBC</name>
                     <description>CBC</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>KEY_SIZE</name>
                     <description>KEY_SIZE</description>
                     <bitRange>[4:3]</bitRange>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>DIR</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>INPUT_RDY</name>
                     <description>INPUT_RDY</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>OUTPUT_RDY</name>
                     <description>OUTPUT_RDY</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESDATALEN0</name>
               <description>Crypto Data Length LSW</description>
               <addressOffset>1364</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEN_LSW</name>
                     <description>LEN_LSW</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESDATALEN1</name>
               <description>Crypto Data Length MSW</description>
               <addressOffset>1368</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEN_MSW</name>
                     <description>LEN_MSW</description>
                     <bitRange>[28:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESAUTHLEN</name>
               <description>AES Authentication Length</description>
               <addressOffset>1372</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>LEN</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
