cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
Writing 1 to a bit position sets the corresponding bit in the DOUT31_0 register</description>
               <addressOffset>144</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO31</name>
                     <description>DIO31</description>
                     <bitRange>[31:31]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO30</name>
                     <description>DIO30</description>
                     <bitRange>[30:30]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO29</name>
                     <description>DIO29</description>
                     <bitRange>[29:29]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO28</name>
                     <description>DIO28</description>
                     <bitRange>[28:28]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO27</name>
                     <description>DIO27</description>
                     <bitRange>[27:27]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO26</name>
                     <description>DIO26</description>
                     <bitRange>[26:26]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO25</name>
                     <description>DIO25</description>
                     <bitRange>[25:25]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO24</name>
                     <description>DIO24</description>
                     <bitRange>[24:24]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO23</name>
                     <description>DIO23</description>
                     <bitRange>[23:23]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO22</name>
                     <description>DIO22</description>
                     <bitRange>[22:22]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO21</name>
                     <description>DIO21</description>
                     <bitRange>[21:21]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO20</name>
                     <description>DIO20</description>
                     <bitRange>[20:20]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO19</name>
                     <description>DIO19</description>
                     <bitRange>[19:19]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO18</name>
                     <description>DIO18</description>
                     <bitRange>[18:18]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO17</name>
                     <description>DIO17</description>
                     <bitRange>[17:17]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO16</name>
                     <description>DIO16</description>
                     <bitRange>[16:16]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO15</name>
                     <description>DIO15</description>
                     <bitRange>[15:15]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO14</name>
                     <description>DIO14</description>
                     <bitRange>[14:14]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO13</name>
                     <description>DIO13</description>
                     <bitRange>[13:13]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO12</name>
                     <description>DIO12</description>
                     <bitRange>[12:12]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO11</name>
                     <description>DIO11</description>
                     <bitRange>[11:11]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO10</name>
                     <description>DIO10</description>
                     <bitRange>[10:10]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO9</name>
                     <description>DIO9</description>
                     <bitRange>[9:9]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO8</name>
                     <description>DIO8</description>
                     <bitRange>[8:8]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO7</name>
                     <description>DIO7</description>
                     <bitRange>[7:7]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO6</name>
                     <description>DIO6</description>
                     <bitRange>[6:6]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO5</name>
                     <description>DIO5</description>
                     <bitRange>[5:5]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO4</name>
                     <description>DIO4</description>
                     <bitRange>[4:4]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO3</name>
                     <description>DIO3</description>
                     <bitRange>[3:3]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO2</name>
                     <description>DIO2</description>
                     <bitRange>[2:2]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO1</name>
                     <description>DIO1</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO0</name>
                     <description>DIO0</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUTCLR31_0</name>
               <description>Data Out Clear

