cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
Reading  this registers will return 1 for triggered event and 0 for non-triggered events. 
Writing a 1 to a bit field will clear the event. 

The configuration of events is done inside MCU IOC, e.g. events for DIO #0 is configured in IOC:IOCFG0.EDGE_DET and IOC:IOCFG0.EDGE_IRQ_EN.

</description>
               <addressOffset>224</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO31</name>
                     <description>DIO31</description>
                     <bitRange>[31:31]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO30</name>
                     <description>DIO30</description>
                     <bitRange>[30:30]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO29</name>
                     <description>DIO29</description>
                     <bitRange>[29:29]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO28</name>
                     <description>DIO28</description>
                     <bitRange>[28:28]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO27</name>
                     <description>DIO27</description>
                     <bitRange>[27:27]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO26</name>
                     <description>DIO26</description>
                     <bitRange>[26:26]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO25</name>
                     <description>DIO25</description>
                     <bitRange>[25:25]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO24</name>
                     <description>DIO24</description>
                     <bitRange>[24:24]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO23</name>
                     <description>DIO23</description>
                     <bitRange>[23:23]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO22</name>
                     <description>DIO22</description>
                     <bitRange>[22:22]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO21</name>
                     <description>DIO21</description>
                     <bitRange>[21:21]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO20</name>
                     <description>DIO20</description>
                     <bitRange>[20:20]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO19</name>
                     <description>DIO19</description>
                     <bitRange>[19:19]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO18</name>
                     <description>DIO18</description>
                     <bitRange>[18:18]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO17</name>
                     <description>DIO17</description>
                     <bitRange>[17:17]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO16</name>
                     <description>DIO16</description>
                     <bitRange>[16:16]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO15</name>
                     <description>DIO15</description>
                     <bitRange>[15:15]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO14</name>
                     <description>DIO14</description>
                     <bitRange>[14:14]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO13</name>
                     <description>DIO13</description>
                     <bitRange>[13:13]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO12</name>
                     <description>DIO12</description>
                     <bitRange>[12:12]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO11</name>
                     <description>DIO11</description>
                     <bitRange>[11:11]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO10</name>
                     <description>DIO10</description>
                     <bitRange>[10:10]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO9</name>
                     <description>DIO9</description>
                     <bitRange>[9:9]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO8</name>
                     <description>DIO8</description>
                     <bitRange>[8:8]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO7</name>
                     <description>DIO7</description>
                     <bitRange>[7:7]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO6</name>
                     <description>DIO6</description>
                     <bitRange>[6:6]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO5</name>
                     <description>DIO5</description>
                     <bitRange>[5:5]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO4</name>
                     <description>DIO4</description>
                     <bitRange>[4:4]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO3</name>
                     <description>DIO3</description>
                     <bitRange>[3:3]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO2</name>
                     <description>DIO2</description>
                     <bitRange>[2:2]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO1</name>
                     <description>DIO1</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DIO0</name>
                     <description>DIO0</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
