cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
Based on the value in the register field TAMR.TAILD, this register is updated with the value from TAPR register either on the next cycle or on the next timeout.


This register shows the current value of the Timer A pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled a read of a timer value will return the current count -1. </description>
               <addressOffset>92</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PSS</name>
                     <description>PSS</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBPS</name>
               <description>Timer B Pre-scale Snap-shot 

Based on the value in the register field TBMR.TBILD, this register is updated with the value from TBPR register either on the next cycle or on the next timeout.

This register shows the current value of the Timer B pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled  a read of a timer value will return the current count -1. </description>
               <addressOffset>96</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PSS</name>
                     <description>PSS</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAPV</name>
               <description>Timer A Pre-scale Value 
This register shows the current value of the Timer A free running pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled,  a read of a timer value will return the current count  1. </description>
               <addressOffset>100</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PSV</name>
                     <description>PSV</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBPV</name>
               <description>Timer B Pre-scale Value 
This register shows the current value of the Timer B free running pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled, a read of a timer value will return the current count-1. </description>
               <addressOffset>104</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PSV</name>
                     <description>PSV</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAEV</name>
               <description>DMA Event 
This register allows software to enable/disable GPT DMA trigger events. </description>
               <addressOffset>108</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBMDMAEN</name>
                     <description>TBMDMAEN</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>CBEDMAEN</name>
                     <description>CBEDMAEN</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>CBMDMAEN</name>
                     <description>CBMDMAEN</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TBTODMAEN</name>
                     <description>TBTODMAEN</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TAMDMAEN</name>
                     <description>TAMDMAEN</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>RTCDMAEN</name>
                     <description>RTCDMAEN</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>CAEDMAEN</name>
                     <description>CAEDMAEN</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CAMDMAEN</name>
                     <description>CAMDMAEN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>TATODMAEN</name>
                     <description>TATODMAEN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERSION</name>
               <description>Peripheral Version
This register provides information regarding the GPT version</description>
               <addressOffset>4016</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000400</resetValue>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>VERSION</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ANDCCP</name>
               <description>Combined CCP Output
This register is used to logically AND CCP output pairs for each timer</description>
               <addressOffset>4020</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCP_AND_EN</name>
                     <description>CCP_AND_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
