cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
In a 16-bit mode, the upper 16 bits of this register read as 0s and have no effect on the state of TBMATCHR.

Note : This register is updated internally (takes effect) based on TAMR.TAMRSU
</description>
               <addressOffset>48</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>TAMATCHR</name>
                     <description>TAMATCHR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBMATCHR</name>
               <description>Timer B Match Register

 When a GPT is configured to one of the 32-bit modes, the contents of bits 15:0 in this register are loaded into the upper 16 bits of  TAMATCHR.
Reads from this register return the current match value of Timer B and writes are ignored.
In a 16-bit mode, bits 15:0 are used for the match value. Bits 31:16 are reserved in both cases.

Note : This register is updated internally (takes effect) based on TBMR.TBMRSU</description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000ffff</resetValue>
               <fields>
                  <field>
                     <name>TBMATCHR</name>
                     <description>TBMATCHR</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAPR</name>
               <description>Timer A Pre-scale
This register allows software to extend the range of the timers when they are used individually.
When in one-shot or periodic down count modes, this register acts as a true prescaler for the timer counter.
When acting as a true prescaler, the prescaler counts down to 0 before the value in TAR and TAV registers are incremented.
In all other individual/split modes, this register is a linear extension of the upper range of the timer counter, holding bits 23:16 in the 16-bit modes of the 16/32-bit GPT.

</description>
               <addressOffset>56</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAPSR</name>
                     <description>TAPSR</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBPR</name>
               <description>Timer B Pre-scale
This register allows software to extend the range of the timers when they are used individually.
When in one-shot or periodic down count modes, this register acts as a true prescaler for the timer counter.
When acting as a true prescaler, the prescaler counts down to 0 before the value in TBR and TBV registers are incremented.
In all other individual/split modes, this register is a linear extension of the upper range of the timer counter, holding bits 23:16 in the 16-bit modes of the 16/32-bit GPT.

</description>
               <addressOffset>60</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBPSR</name>
                     <description>TBPSR</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAPMR</name>
               <description>Timer A Pre-scale Match
This register allows software to extend the range of the TAMATCHR when used individually.  

</description>
               <addressOffset>64</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAPSMR</name>
                     <description>TAPSMR</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBPMR</name>
               <description>Timer B Pre-scale Match
This register allows software to extend the range of the TBMATCHR when used individually.  

</description>
               <addressOffset>68</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBPSMR</name>
                     <description>TBPSMR</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAR</name>
               <description>Timer A Register

</description>
               <addressOffset>72</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>TAR</name>
                     <description>TAR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBR</name>
               <description>Timer B Register</description>
               <addressOffset>76</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000ffff</resetValue>
               <fields>
                  <field>
                     <name>TBR</name>
                     <description>TBR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAV</name>
               <description>Timer A Value 
This register shows the current value of the free running 16-bit Timer A. In the 32-bit mode</description>
               <addressOffset>80</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>TAV</name>
                     <description>TAV</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBV</name>
               <description>Timer B Value 
This register shows the current value of the free running 16-bit Timer B. Note: When the alternate timer clock (TIMCLK) is enabled, a read of a timer value will return the current count  1. </description>
               <addressOffset>84</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000ffff</resetValue>
               <fields>
                  <field>
                     <name>TBV</name>
                     <description>TBV</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCPD</name>
               <description>RTC Pre-divide Value 
This register shows the current value of the RTC pre-divider in RTC mode. Note: When the alternate timer clock (TIMCLK) is enabled, a read of a timer value will return the current count  -1. </description>
               <addressOffset>88</addressOffset>
               <access>read-only</access>
               <resetValue>0x00007fff</resetValue>
               <fields>
                  <field>
                     <name>RTCPD</name>
                     <description>RTCPD</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAPS</name>
               <description>Timer A Pre-scale Snap-shot 

