cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>I2S0</name>
         <description>I2S Audio DMA module supporting formats I2S, LJF, RJF and DSP

</description>
         <baseAddress>0x40021000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>AIFWCLKSRC</name>
               <description>WCLK Source Selection</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WCLK_INV</name>
                     <description>WCLK_INV</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_SRC</name>
                     <description>WCLK_SRC</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFDMACFG</name>
               <description>DMA Buffer Size Configuration</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>END_FRAME_IDX</name>
                     <description>END_FRAME_IDX</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFDIRCFG</name>
               <description>Pin Direction</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AD2</name>
                     <description>AD2</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>AD1</name>
                     <description>AD1</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>AD0</name>
                     <description>AD0</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFFMTCFG</name>
               <description>Serial Interface Format Configuration</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000170</resetValue>
               <fields>
                  <field>
                     <name>DATA_DELAY</name>
                     <description>DATA_DELAY</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>MEM_LEN_24</name>
                     <description>MEM_LEN_24</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SMPL_EDGE</name>
                     <description>SMPL_EDGE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>DUAL_PHASE</name>
                     <description>DUAL_PHASE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>WORD_LEN</name>
                     <description>WORD_LEN</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFWMASK0</name>
               <description>Word Selection Bit Mask for Pin 0</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>MASK</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFWMASK1</name>
               <description>Word Selection Bit Mask for Pin 1</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>MASK</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFWMASK2</name>
               <description>Word Selection Bit Mask for Pin 2

</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>MASK</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFPWMVALUE</name>
               <description>Audio Interface PWM Debug Value</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PULSE_WIDTH</name>
                     <description>PULSE_WIDTH</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFINPTRNEXT</name>
               <description>DMA Input Buffer Next Pointer</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PTR</name>
                     <description>PTR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFINPTR</name>
               <description>DMA Input Buffer Current Pointer</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PTR</name>
                     <description>PTR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFOUTPTRNEXT</name>
               <description>DMA Output Buffer Next Pointer</description>
               <addressOffset>40</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PTR</name>
                     <description>PTR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIFOUTPTR</name>
               <description>DMA Output Buffer Current Pointer</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PTR</name>
                     <description>PTR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPCTL</name>
               <description>SampleStaMP Generator Control Register</description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OUT_RDY</name>
                     <description>OUT_RDY</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>IN_RDY</name>
                     <description>IN_RDY</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>STMP_EN</name>
                     <description>STMP_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPXCNTCAPT0</name>
               <description>Captured XOSC Counter Value, Capture Channel 0</description>
               <addressOffset>56</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAPT_VALUE</name>
                     <description>CAPT_VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPXPER</name>
               <description>XOSC Period Value</description>
               <addressOffset>60</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPWCNTCAPT0</name>
               <description>Captured WCLK Counter Value, Capture Channel 0</description>
               <addressOffset>64</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAPT_VALUE</name>
                     <description>CAPT_VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPWPER</name>
               <description>WCLK Counter Period Value</description>
               <addressOffset>68</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPINTRIG</name>
               <description>WCLK Counter Trigger Value for Input Pins</description>
               <addressOffset>72</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IN_START_WCNT</name>
                     <description>IN_START_WCNT</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPOUTTRIG</name>
               <description>WCLK Counter Trigger Value for Output Pins</description>
               <addressOffset>76</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OUT_START_WCNT</name>
                     <description>OUT_START_WCNT</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPWSET</name>
               <description>WCLK Counter Set Operation</description>
               <addressOffset>80</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPWADD</name>
               <description>WCLK Counter Add Operation</description>
               <addressOffset>84</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE_INC</name>
                     <description>VALUE_INC</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPXPERMIN</name>
               <description>XOSC Minimum Period Value
Minimum Value of STMPXPER</description>
               <addressOffset>88</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000ffff</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPWCNT</name>
               <description>Current Value of WCNT</description>
               <addressOffset>92</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CURR_VALUE</name>
                     <description>CURR_VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPXCNT</name>
               <description>Current Value of XCNT</description>
               <addressOffset>96</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CURR_VALUE</name>
                     <description>CURR_VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPXCNTCAPT1</name>
               <description>Captured XOSC Counter Value, Capture Channel 1</description>
               <addressOffset>100</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAPT_VALUE</name>
                     <description>CAPT_VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>STMPWCNTCAPT1</name>
               <description>Captured WCLK Counter Value, Capture Channel 1</description>
               <addressOffset>104</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAPT_VALUE</name>
                     <description>CAPT_VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQMASK</name>
               <description>Masked Interrupt Status Register</description>
               <addressOffset>112</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AIF_DMA_IN</name>
                     <description>AIF_DMA_IN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>AIF_DMA_OUT</name>
                     <description>AIF_DMA_OUT</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_TIMEOUT</name>
                     <description>WCLK_TIMEOUT</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>BUS_ERR</name>
                     <description>BUS_ERR</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_ERR</name>
                     <description>WCLK_ERR</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>PTR_ERR</name>
                     <description>PTR_ERR</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQFLAGS</name>
               <description>Raw Interrupt Status Register</description>
               <addressOffset>116</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AIF_DMA_IN</name>
                     <description>AIF_DMA_IN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>AIF_DMA_OUT</name>
                     <description>AIF_DMA_OUT</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_TIMEOUT</name>
                     <description>WCLK_TIMEOUT</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>BUS_ERR</name>
                     <description>BUS_ERR</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_ERR</name>
                     <description>WCLK_ERR</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>PTR_ERR</name>
                     <description>PTR_ERR</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQSET</name>
               <description>Interrupt Set Register</description>
               <addressOffset>120</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AIF_DMA_IN</name>
                     <description>AIF_DMA_IN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>AIF_DMA_OUT</name>
                     <description>AIF_DMA_OUT</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_TIMEOUT</name>
                     <description>WCLK_TIMEOUT</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>BUS_ERR</name>
                     <description>BUS_ERR</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_ERR</name>
                     <description>WCLK_ERR</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>PTR_ERR</name>
                     <description>PTR_ERR</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQCLR</name>
               <description>Interrupt Clear Register</description>
               <addressOffset>124</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AIF_DMA_IN</name>
                     <description>AIF_DMA_IN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>AIF_DMA_OUT</name>
                     <description>AIF_DMA_OUT</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_TIMEOUT</name>
                     <description>WCLK_TIMEOUT</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>BUS_ERR</name>
                     <description>BUS_ERR</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_ERR</name>
                     <description>WCLK_ERR</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>PTR_ERR</name>
                     <description>PTR_ERR</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
