cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>PRCM</name>
         <description>Power, Reset and Clock Management

</description>
         <baseAddress>0x40082000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x00001000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>INFRCLKDIVR</name>
               <description>Infrastructure Clock Division Factor For Run Mode</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RATIO</name>
                     <description>RATIO</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>INFRCLKDIVS</name>
               <description>Infrastructure Clock Division Factor For Sleep Mode</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RATIO</name>
                     <description>RATIO</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>INFRCLKDIVDS</name>
               <description>Infrastructure Clock Division Factor For DeepSleep Mode</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RATIO</name>
                     <description>RATIO</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VDCTL</name>
               <description>MCU Voltage Domain Control</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCU_VD</name>
                     <description>MCU_VD</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>ULDO</name>
                     <description>ULDO</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKLOADCTL</name>
               <description>Clock Load Control</description>
               <addressOffset>40</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>LOAD_DONE</name>
                     <description>LOAD_DONE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>LOAD</name>
                     <description>LOAD</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCCLKG</name>
               <description>RFC Clock Gate</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VIMSCLKG</name>
               <description>VIMS Clock Gate</description>
               <addressOffset>48</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECDMACLKGR</name>
               <description>TRNG, CRYPTO And UDMA Clock Gate For Run Mode</description>
               <addressOffset>60</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_CLK_EN</name>
                     <description>DMA_CLK_EN</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TRNG_CLK_EN</name>
                     <description>TRNG_CLK_EN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>CRYPTO_CLK_EN</name>
                     <description>CRYPTO_CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECDMACLKGS</name>
               <description>TRNG, CRYPTO And UDMA Clock Gate For Sleep Mode</description>
               <addressOffset>64</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_CLK_EN</name>
                     <description>DMA_CLK_EN</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TRNG_CLK_EN</name>
                     <description>TRNG_CLK_EN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>CRYPTO_CLK_EN</name>
                     <description>CRYPTO_CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECDMACLKGDS</name>
               <description>TRNG, CRYPTO And UDMA Clock Gate For Deep Sleep Mode</description>
               <addressOffset>68</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_CLK_EN</name>
                     <description>DMA_CLK_EN</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TRNG_CLK_EN</name>
                     <description>TRNG_CLK_EN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>CRYPTO_CLK_EN</name>
                     <description>CRYPTO_CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIOCLKGR</name>
               <description>GPIO Clock Gate For Run Mode</description>
               <addressOffset>72</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIOCLKGS</name>
               <description>GPIO Clock Gate For Sleep Mode</description>
               <addressOffset>76</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIOCLKGDS</name>
               <description>GPIO Clock Gate For Deep Sleep Mode</description>
               <addressOffset>80</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPTCLKGR</name>
               <description>GPT Clock Gate For Run Mode</description>
               <addressOffset>84</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPTCLKGS</name>
               <description>GPT Clock Gate For Sleep Mode</description>
               <addressOffset>88</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPTCLKGDS</name>
               <description>GPT Clock Gate For Deep Sleep Mode</description>
               <addressOffset>92</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2CCLKGR</name>
               <description>I2C Clock Gate For Run Mode</description>
               <addressOffset>96</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2CCLKGS</name>
               <description>I2C Clock Gate For Sleep Mode</description>
               <addressOffset>100</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2CCLKGDS</name>
               <description>I2C Clock Gate For Deep Sleep Mode</description>
               <addressOffset>104</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTCLKGR</name>
               <description>UART Clock Gate For Run Mode</description>
               <addressOffset>108</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTCLKGS</name>
               <description>UART Clock Gate For Sleep Mode</description>
               <addressOffset>112</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTCLKGDS</name>
               <description>UART Clock Gate For Deep Sleep Mode</description>
               <addressOffset>116</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSICLKGR</name>
               <description>SSI Clock Gate For Run Mode</description>
               <addressOffset>120</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSICLKGS</name>
               <description>SSI Clock Gate For Sleep Mode</description>
               <addressOffset>124</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSICLKGDS</name>
               <description>SSI Clock Gate For Deep Sleep Mode</description>
               <addressOffset>128</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SCLKGR</name>
               <description>I2S Clock Gate For Run Mode</description>
               <addressOffset>132</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SCLKGS</name>
               <description>I2S Clock Gate For Sleep Mode</description>
               <addressOffset>136</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SCLKGDS</name>
               <description>I2S Clock Gate For Deep Sleep Mode</description>
               <addressOffset>140</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLK_EN</name>
                     <description>CLK_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPUCLKDIV</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>184</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RATIO</name>
                     <description>RATIO</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SBCLKSEL</name>
               <description>I2S Clock Control</description>
               <addressOffset>200</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC</name>
                     <description>SRC</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPTCLKDIV</name>
               <description>GPT Scalar</description>
               <addressOffset>204</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RATIO</name>
                     <description>RATIO</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SCLKCTL</name>
               <description>I2S Clock Control</description>
               <addressOffset>208</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMPL_ON_POSEDGE</name>
                     <description>SMPL_ON_POSEDGE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>WCLK_PHASE</name>
                     <description>WCLK_PHASE</description>
                     <bitRange>[2:1]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SMCLKDIV</name>
               <description>MCLK Division Ratio</description>
               <addressOffset>212</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MDIV</name>
                     <description>MDIV</description>
                     <bitRange>[9:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SBCLKDIV</name>
               <description>BCLK Division Ratio</description>
               <addressOffset>216</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BDIV</name>
                     <description>BDIV</description>
                     <bitRange>[9:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SWCLKDIV</name>
               <description>WCLK Division Ratio</description>
               <addressOffset>220</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDIV</name>
                     <description>WDIV</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWRESET</name>
               <description>SW Initiated Resets</description>
               <addressOffset>268</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCU</name>
                     <description>MCU</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>WARMRESET</name>
               <description>WARM Reset Control And Status</description>
               <addressOffset>272</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WR_TO_PINRESET</name>
                     <description>WR_TO_PINRESET</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>LOCKUP_STAT</name>
                     <description>LOCKUP_STAT</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>WDT_STAT</name>
                     <description>WDT_STAT</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
