cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>SSI1</name>
         <description>Synchronous Serial Interface with master and slave capabilities

</description>
         <baseAddress>0x40008000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR0</name>
               <description>Control 0</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR</name>
                     <description>SCR</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>SPH</name>
                     <description>SPH</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SPO</name>
                     <description>SPO</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>FRF</name>
                     <description>FRF</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>DSS</name>
                     <description>DSS</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR1</name>
               <description>Control 1</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOD</name>
                     <description>SOD</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>MS</name>
                     <description>MS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>SSE</name>
                     <description>SSE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>LBM</name>
                     <description>LBM</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <description>Data
16-bits wide data register:
When read, the entry in the receive FIFO, pointed to by the current FIFO read pointer, is accessed. As data values are removed by the  receive logic from the incoming data frame, they are placed into the entry in the receive FIFO, pointed to by the current FIFO write pointer.
When written, the entry in the transmit FIFO, pointed to by the write pointer, is written to. Data values are removed from the transmit FIFO one value at a time by the transmit logic. It is loaded into the transmit serial shifter, then serially shifted out onto the TXD output pin at the programmed bit rate.
When a data size of less than 16 bits is selected, the user must right-justify data written to the transmit FIFO. The transmit logic ignores the unused bits. Received data less than 16 bits is automatically right-justified in the receive buffer.</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status</description>
               <addressOffset>12</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>BSY</name>
                     <description>BSY</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>RFF</name>
                     <description>RFF</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>RNE</name>
                     <description>RNE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>TNF</name>
                     <description>TNF</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>TFE</name>
                     <description>TFE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPSR</name>
               <description>Clock Prescale</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CPSDVSR</name>
                     <description>CPSDVSR</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMSC</name>
               <description>Interrupt Mask Set and Clear</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXIM</name>
                     <description>TXIM</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>RXIM</name>
                     <description>RXIM</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>RTIM</name>
                     <description>RTIM</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RORIM</name>
                     <description>RORIM</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RIS</name>
               <description>Raw Interrupt Status</description>
               <addressOffset>24</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000008</resetValue>
               <fields>
                  <field>
                     <name>TXRIS</name>
                     <description>TXRIS</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>RXRIS</name>
                     <description>RXRIS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>RTRIS</name>
                     <description>RTRIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RORRIS</name>
                     <description>RORRIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MIS</name>
               <description>Masked Interrupt Status</description>
               <addressOffset>28</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXMIS</name>
                     <description>TXMIS</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>RXMIS</name>
                     <description>RXMIS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>RTMIS</name>
                     <description>RTMIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RORMIS</name>
                     <description>RORMIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <description>Interrupt Clear
On a write of 1, the corresponding interrupt is cleared. A write of 0 has no effect.</description>
               <addressOffset>32</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTIC</name>
                     <description>RTIC</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RORIC</name>
                     <description>RORIC</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACR</name>
               <description>DMA Control</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXDMAE</name>
                     <description>TXDMAE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RXDMAE</name>
                     <description>RXDMAE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
