cmsis-svd/cmsis-svd/data/TexasInstruments/CC13x0.svd
         </registers>
      </peripheral><peripheral>
         <name>UART0</name>
         <description>Universal Asynchronous Receiver/Transmitter (UART) interface

</description>
         <baseAddress>0x40001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DR</name>
               <description>Data
For words to be transmitted:
  - if the FIFOs are enabled (LCRH.FEN = 1), data written to this location is pushed onto the transmit FIFO
  - if the FIFOs are not enabled (LCRH.FEN = 0), data is stored in the transmitter holding register (the bottom word of the transmit FIFO).
The write operation initiates transmission from the UART. The data is prefixed with a start bit, appended with the appropriate parity bit (if parity is enabled), and a stop bit.
The resultant word is then transmitted.
For received words:
  - if the FIFOs are enabled (LCRH.FEN = 1), the data byte and the 4-bit status (break, frame, parity, and overrun) is pushed onto the 12-bit wide receive FIFO 
  - if the FIFOs are not enabled (LCRH.FEN = 0), the data byte and status are stored in the receiving holding register (the bottom word of the receive FIFO).
The received data byte is read by performing reads from this register along with the corresponding status information. The status information can also be read by a read of the RSR register.</description>
               <addressOffset>0</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>OE</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>BE</name>
                     <description>BE</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>PE</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>FE</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSR</name>
               <description>Status
This register is mapped to the same address as ECR register.  Reads from this address are associated with RSR register and return the receive status. Writes to this address are associated with ECR register and clear the receive status flags (framing, parity, break, and overrun errors).
If the status is read from this register, then the status information for break, framing and parity corresponds to the data character read from the Data Register, DR prior to reading the RSR. The status information for overrun is set immediately when an overrun condition occurs.</description>
               <addressOffset>4</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>OE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>BE</name>
                     <description>BE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>PE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>FE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <description>Error Clear
This register is mapped to the same address as RSR register.  Reads from this address are associated with RSR register and return the receive status. Writes to this address are associated with ECR register and clear the receive status flags (framing, parity, break, and overrun errors).</description>
               <addressOffset>4</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>OE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>BE</name>
                     <description>BE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>PE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>FE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            <alternateRegister>RSR</alternateRegister></register>
            <register>
               <name>FR</name>
               <description>Flag
Reads from this register return the UART flags.</description>
               <addressOffset>24</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000090</resetValue>
               <fields>
                  <field>
                     <name>TXFE</name>
                     <description>TXFE</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RXFF</name>
                     <description>RXFF</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TXFF</name>
                     <description>TXFF</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>RXFE</name>
                     <description>RXFE</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>CTS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IBRD</name>
               <description>Integer Baud-Rate Divisor
If this register is modified while trasmission or reception is on-going, the baudrate will not be updated until transmission or reception of the current character is complete.</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIVINT</name>
                     <description>DIVINT</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBRD</name>
               <description>Fractional Baud-Rate Divisor
If this register is modified while trasmission or reception is on-going, the baudrate will not be updated until transmission or reception of the current character is complete.</description>
               <addressOffset>40</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIVFRAC</name>
                     <description>DIVFRAC</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCRH</name>
               <description>Line Control</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPS</name>
                     <description>SPS</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>WLEN</name>
                     <description>WLEN</description>
                     <bitRange>[6:5]</bitRange>
                  </field>
                  <field>
                     <name>FEN</name>
                     <description>FEN</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>STP2</name>
                     <description>STP2</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>EPS</name>
                     <description>EPS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>PEN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>BRK</name>
                     <description>BRK</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <description>Control</description>
               <addressOffset>48</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000300</resetValue>
               <fields>
                  <field>
                     <name>CTSEN</name>
                     <description>CTSEN</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>RTSEN</name>
                     <description>RTSEN</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>RTS</name>
                     <description>RTS</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>RXE</name>
                     <description>RXE</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TXE</name>
                     <description>TXE</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>LBE</name>
                     <description>LBE</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>UARTEN</name>
                     <description>UARTEN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFLS</name>
               <description>Interrupt FIFO Level Select</description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000012</resetValue>
               <fields>
                  <field>
                     <name>RXSEL</name>
                     <description>RXSEL</description>
                     <bitRange>[5:3]</bitRange>
                  </field>
                  <field>
                     <name>TXSEL</name>
                     <description>TXSEL</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMSC</name>
               <description>Interrupt Mask Set/Clear</description>
               <addressOffset>56</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OEIM</name>
                     <description>OEIM</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>BEIM</name>
                     <description>BEIM</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>PEIM</name>
                     <description>PEIM</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>FEIM</name>
                     <description>FEIM</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RTIM</name>
                     <description>RTIM</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TXIM</name>
                     <description>TXIM</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>RXIM</name>
                     <description>RXIM</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>CTSMIM</name>
                     <description>CTSMIM</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RIS</name>
               <description>Raw Interrupt Status</description>
               <addressOffset>60</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000000d</resetValue>
               <fields>
                  <field>
                     <name>OERIS</name>
                     <description>OERIS</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>BERIS</name>
                     <description>BERIS</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>PERIS</name>
                     <description>PERIS</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>FERIS</name>
                     <description>FERIS</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RTRIS</name>
                     <description>RTRIS</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TXRIS</name>
                     <description>TXRIS</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>RXRIS</name>
                     <description>RXRIS</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>CTSRMIS</name>
                     <description>CTSRMIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MIS</name>
               <description>Masked Interrupt Status</description>
               <addressOffset>64</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OEMIS</name>
                     <description>OEMIS</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>BEMIS</name>
                     <description>BEMIS</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>PEMIS</name>
                     <description>PEMIS</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>FEMIS</name>
                     <description>FEMIS</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RTMIS</name>
                     <description>RTMIS</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TXMIS</name>
                     <description>TXMIS</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>RXMIS</name>
                     <description>RXMIS</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>CTSMMIS</name>
                     <description>CTSMMIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <description>Interrupt Clear
On a write of 1, the corresponding interrupt is cleared. A write of 0 has no effect.</description>
               <addressOffset>68</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OEIC</name>
                     <description>OEIC</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>BEIC</name>
                     <description>BEIC</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>PEIC</name>
                     <description>PEIC</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>FEIC</name>
                     <description>FEIC</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RTIC</name>
                     <description>RTIC</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TXIC</name>
                     <description>TXIC</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>RXIC</name>
                     <description>RXIC</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>CTSMIC</name>
                     <description>CTSMIC</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACTL</name>
               <description>DMA Control</description>
               <addressOffset>72</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMAONERR</name>
                     <description>DMAONERR</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>TXDMAE</name>
                     <description>TXDMAE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RXDMAE</name>
                     <description>RXDMAE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
